gastonfeng/STM32Ethernet/src/utility/ethernetif.c
      /**ETH GPIO Configuration    
    PC1     ------> ETH_MDC
    PA1     ------> ETH_REF_CLK
    PA2     ------> ETH_MDIO
    PA7     ------> ETH_CRS_DV
    PC4     ------> ETH_RXD0
    PC5     ------> ETH_RXD1
    PB11     ------> ETH_TX_EN
    PB12     ------> ETH_TXD0
    PB13     ------> ETH_TXD1 
    */
      HAL_GPIO_DeInit(GPIOC, GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5);

      HAL_GPIO_DeInit(GPIOA, GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7);

      HAL_GPIO_DeInit(GPIOB, GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13);

      /* USER CODE BEGIN ETH_MspDeInit 1 */

      /* USER CODE END ETH_MspDeInit 1 */
    }
  }

  /* USER CODE BEGIN 4 */
  void phy_dump()
  {
    int i;
    for (i = 0; i < 32; i++)
    {
      char buf[32];
      uint32_t val;
      HAL_ETH_ReadPHYRegister(&heth, i, &val);
      sprintf(buf, "%d = 0x%x\n", i, (unsigned int)val);
      core_debug(buf);
    }
  }
  /* USER CODE END 4 */

  /*******************************************************************************
                       LL Driver Interface ( LwIP stack --> ETH) 
*******************************************************************************/
  /**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */
  static void low_level_init(struct netif *netif)
  {
    // uint32_t regvalue = 0;
    HAL_StatusTypeDef hal_eth_init_status;

    /* Init ETH */

    heth.Instance = ETH;
    heth.Init.AutoNegotiation = ETH_AUTONEGOTIATION_DISABLE;
    heth.Init.Speed = ETH_SPEED_100M;
    heth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
    heth.Init.PhyAddress = 3;
    heth.Init.MACAddr = macaddress;
    heth.Init.RxMode = ETH_RXPOLLING_MODE;
    heth.Init.ChecksumMode = ETH_CHECKSUM_BY_HARDWARE;
    heth.Init.MediaInterface = ETH_MEDIA_INTERFACE_RMII;

    /* USER CODE BEGIN MACADDRESS */
    // HAL_GPIO_WritePin(ETH_RST_GPIO_Port,ETH_RST_Pin,0);
    // HAL_Delay(200);
    // HAL_GPIO_WritePin(ETH_RST_GPIO_Port,ETH_RST_Pin,1);
    // HAL_Delay(200);
    /* USER CODE END MACADDRESS */

    hal_eth_init_status = HAL_ETH_Init(&heth);

    if (hal_eth_init_status == HAL_OK)
    {
      /* Set netif link flag */
      netif->flags |= NETIF_FLAG_LINK_UP;
    }
    else
    {
      core_debug("hal_eth_init_status error");
    }
    /* Initialize Tx Descriptors list: Chain Mode */
    HAL_ETH_DMATxDescListInit(&heth, DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);

    /* Initialize Rx Descriptors list: Chain Mode  */
    HAL_ETH_DMARxDescListInit(&heth, DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);

#if LWIP_ARP || LWIP_ETHERNET

    /* set MAC hardware address length */
    netif->hwaddr_len = ETH_HWADDR_LEN;

    /* set MAC hardware address */
    netif->hwaddr[0] = macaddress[0];
    netif->hwaddr[1] = macaddress[1];
    netif->hwaddr[2] = macaddress[2];
    netif->hwaddr[3] = macaddress[3];
    netif->hwaddr[4] = macaddress[4];
    netif->hwaddr[5] = macaddress[5];

    /* maximum transfer unit */
    netif->mtu = 1500;

    /* device capabilities */
    /* don't set NETIF_FLAG_ETHARP if this device is not an ethernet one */
#if LWIP_ARP
    netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP|NETIF_FLAG_IGMP;
#else
    netif->flags |= NETIF_FLAG_BROADCAST|NETIF_FLAG_IGMP;
#endif /* LWIP_ARP */

    /* Enable MAC and DMA transmission and reception */
    HAL_ETH_Start(&heth);

    /* USER CODE BEGIN PHY_PRE_CONFIG */

    /* USER CODE END PHY_PRE_CONFIG */

    /**** Configure PHY to generate an interrupt when Eth Link state changes ****/
    // /* Read Register Configuration */
    // HAL_ETH_ReadPHYRegister(&heth, PHY_MICR, &regvalue);

    // regvalue |= (PHY_MICR_INT_EN | PHY_MICR_INT_OE);

    // /* Enable Interrupts */
    // HAL_ETH_WritePHYRegister(&heth, PHY_MICR, regvalue);

    // /* Read Register Configuration */
    // HAL_ETH_ReadPHYRegister(&heth, PHY_MISR, &regvalue);

    // regvalue |= PHY_MISR_LINK_INT_EN;

    // /* Enable Interrupt on change of link status */
    // HAL_ETH_WritePHYRegister(&heth, PHY_MISR, regvalue);
#endif /* LWIP_ARP || LWIP_ETHERNET */

    /* USER CODE BEGIN LOW_LEVEL_INIT */
    // phy_dump();
    /* USER CODE END LOW_LEVEL_INIT */
  }

  /**
 * This function should do the actual transmission of the packet. The packet is
 * contained in the pbuf that is passed to the function. This pbuf
 * might be chained.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @param p the MAC packet to send (e.g. IP packet including MAC addresses and type)
 * @return ERR_OK if the packet could be sent
 *         an err_t value if the packet couldn't be sent
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full can lead to
 *       strange results. You might consider waiting for space in the DMA queue
 *       to become availale since the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 */

  static err_t low_level_output(struct netif *netif, struct pbuf *p)
  {
    err_t errval;
    struct pbuf *q;
    uint8_t *buffer = (uint8_t *)(heth.TxDesc->Buffer1Addr);
    __IO ETH_DMADescTypeDef *DmaTxDesc;
    uint32_t framelength = 0;
    uint32_t bufferoffset = 0;
    uint32_t byteslefttocopy = 0;
    uint32_t payloadoffset = 0;
    DmaTxDesc = heth.TxDesc;
    bufferoffset = 0;

    /* copy frame from pbufs to driver buffers */
    for (q = p; q != NULL; q = q->next)
    {
      /* Is this buffer available? If not, goto error */
      if ((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET)
      {
        errval = ERR_USE;
        // core_debug("error %s ,L%d", __FILE__, __LINE__);
        goto error;
      }

      /* Get bytes in current lwIP buffer */
      byteslefttocopy = q->len;
      payloadoffset = 0;

      /* Check if the length of data to copy is bigger than Tx buffer size*/
      while ((byteslefttocopy + bufferoffset) > ETH_TX_BUF_SIZE)
      {
        /* Copy data to Tx buffer*/
        memcpy((uint8_t *)((uint8_t *)buffer + bufferoffset), (uint8_t *)((uint8_t *)q->payload + payloadoffset), (ETH_TX_BUF_SIZE - bufferoffset));

