gastonfeng/STM32Ethernet/src/utility/ethernetif.c
#if LWIP_NETIF_HOSTNAME
    /* Initialize interface hostname */
    netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

    netif->name[0] = IFNAME0;
    netif->name[1] = IFNAME1;
    /* We directly use etharp_output() here to save a function call.
   * You can instead declare your own function an call etharp_output()
   * from it if you have to do some checks before sending (e.g. if link
   * is available...) */

#if LWIP_IPV4
#if LWIP_ARP || LWIP_ETHERNET
#if LWIP_ARP
    netif->output = etharp_output;
#else
    /* The user should write ist own code in low_level_output_arp_off function */
    netif->output = low_level_output_arp_off;
#endif /* LWIP_ARP */
#endif /* LWIP_ARP || LWIP_ETHERNET */
#endif /* LWIP_IPV4 */

#if LWIP_IPV6
    netif->output_ip6 = ethip6_output;
#endif /* LWIP_IPV6 */

    netif->linkoutput = low_level_output;

    /* initialize the hardware */
    low_level_init(netif);

    return ERR_OK;
  }

  /* USER CODE BEGIN 6 */

  /**
* @brief  Returns the current time in milliseconds
*         when LWIP_TIMERS == 1 and NO_SYS == 1
* @param  None
* @retval Time
*/
  u32_t sys_jiffies(void)
  {
    return HAL_GetTick();
  }

  /**
* @brief  Returns the current time in milliseconds
*         when LWIP_TIMERS == 1 and NO_SYS == 1
* @param  None
* @retval Time
*/
  u32_t sys_now(void)
  {
    return HAL_GetTick();
  }

  /**
  * @brief  This function sets the netif link status.
  * @param  netif: the network interface
  * @retval None
  */
  uint32_t EthernetLinkTimer = 0;

  void ethernetif_set_link(struct netif *netif)
  {
    uint32_t regvalue = 0;
    /* Ethernet Link every 200ms */
    if (HAL_GetTick() - EthernetLinkTimer >= 200)
    {
      EthernetLinkTimer = HAL_GetTick();

      /* Read PHY_BSR*/
      HAL_ETH_ReadPHYRegister(&heth, PHY_BSR, &regvalue);

      regvalue &= PHY_LINKED_STATUS;

      /* Check whether the netif link down and the PHY link is up */
      if (!netif_is_link_up(netif) && (regvalue))
      {
        /* network cable is connected */
        netif_set_link_up(netif);
      }
      else if (netif_is_link_up(netif) && (!regvalue))
      {
        /* network cable is disconnected */
        netif_set_link_down(netif);
      }
    }
  }

  /* USER CODE BEGIN 7 */

  /* USER CODE END 7 */

#if LWIP_NETIF_LINK_CALLBACK
  /**
  * @brief  Link callback function, this function is called on change of link status
  *         to update low level driver configuration.
  * @param  netif: The network interface
  * @retval None
  */
  void ethernetif_update_config(struct netif *netif)
  {
    __IO uint32_t tickstart = 0;
    uint32_t regvalue = 0;

    if (netif_is_link_up(netif))
    {
      /* Restart the auto-negotiation */
      if (heth.Init.AutoNegotiation != ETH_AUTONEGOTIATION_DISABLE)
      {
        /* Enable Auto-Negotiation */
        HAL_ETH_WritePHYRegister(&heth, PHY_BCR, PHY_AUTONEGOTIATION);

        /* Get tick */
        tickstart = HAL_GetTick();

        /* Wait until the auto-negotiation will be completed */
        do
        {
          HAL_ETH_ReadPHYRegister(&heth, PHY_BSR, &regvalue);

          /* Check for the Timeout ( 1s ) */
          if ((HAL_GetTick() - tickstart) > 1000)
          {
            /* In case of timeout */
            goto error;
          }
        } while (((regvalue & PHY_AUTONEGO_COMPLETE) != PHY_AUTONEGO_COMPLETE));

        /* Read the result of the auto-negotiation */
        HAL_ETH_ReadPHYRegister(&heth, PHY_SR, &regvalue);

        /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
        if ((regvalue & PHY_DUPLEX_STATUS) != (uint32_t)RESET)
        {
          /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
          heth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
        }
        else
        {
          /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
          heth.Init.DuplexMode = ETH_MODE_HALFDUPLEX;
        }
        /* Configure the MAC with the speed fixed by the auto-negotiation process */
        if (regvalue & PHY_SPEED_STATUS)
        {
          /* Set Ethernet speed to 10M following the auto-negotiation */
          heth.Init.Speed = ETH_SPEED_10M;
        }
        else
        {
          /* Set Ethernet speed to 100M following the auto-negotiation */
          heth.Init.Speed = ETH_SPEED_100M;
        }
      }
      else /* AutoNegotiation Disable */
      {
      error:
        /* Check parameters */
        assert_param(IS_ETH_SPEED(heth.Init.Speed));
        assert_param(IS_ETH_DUPLEX_MODE(heth.Init.DuplexMode));

        /* Set MAC Speed and Duplex Mode to PHY */
        HAL_ETH_WritePHYRegister(&heth, PHY_BCR, ((uint16_t)(heth.Init.DuplexMode >> 3) | (uint16_t)(heth.Init.Speed >> 1)));
      }

      /* ETHERNET MAC Re-Configuration */
      HAL_ETH_ConfigMAC(&heth, (ETH_MACInitTypeDef *)NULL);

      /* Restart MAC interface */
      HAL_ETH_Start(&heth);
    }
    else
    {
      /* Stop MAC interface */
      HAL_ETH_Stop(&heth);
    }

    ethernetif_notify_conn_changed(netif);
  }

  /**
  * @brief  This function notify user about link status changement.
  * @param  netif: the network interface
  * @retval None
  */
  __weak void ethernetif_notify_conn_changed(struct netif *netif)
  {
    /* NOTE : This is function clould be implemented in user file
            when the callback is needed,
  */
  }
/* USER CODE END 8 */
#endif /* LWIP_NETIF_LINK_CALLBACK */

  /* USER CODE BEGIN 9 */
  /**
  * @brief  This function set a custom MAC address. This function must be called
  *         before ethernetif_init().
  * @param  mac: mac address
  * @retval None
  */
  void ethernetif_set_mac_addr(const uint8_t *mac)
  {
    if (mac != NULL)
    {
      memcpy(macaddress, mac, 6);
    }
  }
  /* USER CODE END 9 */
  /************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
